/*
 Navicat Premium Data Transfer

 Source Server         : mysql
 Source Server Type    : MySQL
 Source Server Version : 50729
 Source Host           : localhost:3306
 Source Schema         : zhongyao

 Target Server Type    : MySQL
 Target Server Version : 50729
 File Encoding         : 65001

 Date: 20/04/2020 19:57:28
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for drug
-- ----------------------------
DROP TABLE IF EXISTS `drug`;
CREATE TABLE `drug` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `drugname` text NOT NULL,
  `efficacy` text,
  `medprope` text,
  `medtaste` text,
  `categorize` text,
  `amount` double(10,3) DEFAULT '0.000',
  `price` double(10,3) DEFAULT '0.000',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=204 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of drug
-- ----------------------------
BEGIN;
INSERT INTO `drug` VALUES (1, '蒲公英', '清热药', '苦、甘', '寒', '肝、胃', 0.000, 0.500);
INSERT INTO `drug` VALUES (2, '牛蒡子', '解表药', '辛、苦', '寒', '肺、胃', 0.000, 0.350);
INSERT INTO `drug` VALUES (3, '甘草', '补虚药', '甘', '平', '心、肺、脾、胃', 0.000, 2.100);
INSERT INTO `drug` VALUES (4, '马勃', '清热药', '辛', '平', '肺', 0.000, 5.600);
INSERT INTO `drug` VALUES (5, '硼砂', '拔毒药', '甘、咸', '凉', '肺、胃', 0.000, 4.200);
INSERT INTO `drug` VALUES (6, '青黛', '清热药', '咸', '寒', '肝、肺', 0.000, 5.600);
INSERT INTO `drug` VALUES (7, '金银花', '清热药', '甘', '寒', '肺、心、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (8, '连翘', '清热药', '苦', '寒', '肺、心、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (9, '黄芩', '清热药', '苦', '寒', '肺、胆、脾、胃、大肠、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (10, '山栀', '清热药', '苦', '寒', '心、肺、三焦', 0.000, 0.000);
INSERT INTO `drug` VALUES (11, '大黄', '泻下药', '苦', '寒', '脾、胃、大肠、肝、心包', 0.000, 0.000);
INSERT INTO `drug` VALUES (12, '瓜蒌', '化痰止咳平喘药', '甘、苦', '寒', '肺、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (13, '芒硝', '泻下药', '咸、苦', '寒', '胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (14, '薄荷', '解表药', '辛', '凉', '肺、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (15, '玄参', '清热药', '甘、苦、咸', '寒', '肺、胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (16, '桔梗', '化痰止咳平喘药', '苦、辛', '平', '肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (17, '浙贝母', '化痰止咳平喘药', '苦', '寒', '肺、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (18, '龙胆草', '清热药', '苦', '寒', '肝、胆', 0.000, 0.000);
INSERT INTO `drug` VALUES (19, '蒲黄', '止血药', '甘', '平', '肝、心包', 0.000, 0.000);
INSERT INTO `drug` VALUES (20, '黄柏', '清热药', '苦', '寒', '肾、膀胱、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (21, '牛膝', '活血化瘀药', '苦、甘、酸', '平', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (22, '黄连', '清热药', '苦', '寒', '心、脾、胃、胆、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (23, '薏苡仁', '利水渗湿药', '甘、淡', '凉', '脾、胃、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (24, '佩兰', '化湿药', '辛', '平', '脾、胃、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (25, '生地', '清热药', '甘、苦', '寒', '心、肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (26, '细辛', '解表药', '辛', '温', '肺、肾、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (27, '牡丹皮', '清热药', '苦、辛', '寒', '心、肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (28, '当归', '补虚药', '甘、辛', '温', '肝、心、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (29, '赤芍', '清热药', '苦', '寒', '肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (30, '川楝子', '理气药', '苦', '寒', '肝、小肠、胃、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (31, '芦荟', '泻下药', '苦', '寒', '肝、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (32, '石膏', '清热药', '甘、辛', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (33, '麦冬', '补虚药', '甘、苦', '寒', '肺、心、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (34, '金果榄', '清热药', '苦', '寒', '肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (35, '知母', '清热药', '苦、甘', '寒', '肺、胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (36, '天花粉', '清热药', '甘、苦', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (37, '山豆根', '清热药', '苦', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (38, '升麻', '解表药', '甘、辛', '寒', '肺、脾、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (39, '枳壳', '理气药', '苦、辛、酸', '温', '脾、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (40, '枳实', '理气药', '苦、辛、酸', '温', '脾、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (41, '芦根', '清热药', '甘', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (42, '白茅根', '止血药', '甘', '寒', '肺、胃、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (43, '蔓荆子', '解表药', '辛、苦', '寒', '肝、胃、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (44, '桑叶', '解表药', '甘、苦', '寒', '肺、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (45, '桑枝', '祛风湿药', '苦', '平', '肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (46, '淡豆豉', '解表药', '苦、辛', '凉', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (47, '杏仁', '化痰止咳平喘药', '苦', '温', '肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (48, '薤白', '理气药', '辛、苦', '温', '肺、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (49, '山慈菇', '清热药', '甘、辛', '凉', '肝、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (50, '锦灯笼', '清热药', '苦', '寒', '肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (51, '板蓝根', '清热药', '苦', '寒', '心、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (52, '厚朴', '化湿药', '苦、辛', '温', '脾、胃、肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (53, '代代花', '理气药', '甘、苦', '平', '肝、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (54, '鸡内金', '消食药', '甘', '平', '脾、胃、小肠、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (55, '谷芽', '消食药', '甘', '温', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (56, '麦芽', '消食药', '甘', '平', '脾、胃、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (57, '旋覆花', '化痰止咳平喘药', '苦、辛、咸', '温', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (58, '代赭石', '平肝熄风药', '苦', '寒', '肝、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (59, '茜草', '止血药', '苦', '寒', '肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (60, '丹参', '活血化瘀药', '苦', '寒', '心、心包、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (61, '白芝麻', '补虚药', '甘', '平', '肝、肾、肺、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (62, '黑芝麻', '补虚药', '甘', '平', '肝、肾、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (63, '吴茱萸', '温里药', '辛、苦', '热', '肝、肾、胃、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (64, '桃仁', '活血化瘀药', '苦、甘', '平', '心、肝、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (65, '西洋参', '补虚药', '甘、苦', '凉', '肺、心、肾、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (66, '白扁豆', '补虚药', '甘', '温', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (67, '枳椇子', '利水渗湿药', '甘、酸', '平', '脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (68, '葛花', '解表药', '甘', '平', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (69, '郁金', '活血化瘀药', '辛、苦', '寒', '肝、胆、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (70, '砂仁', '化湿药', '辛', '温', '脾、胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (71, '火麻仁', '泻下药', '甘', '平', '脾、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (72, '陈皮', '理气药', '辛、苦', '温', '脾、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (73, '天冬', '补虚药', '甘、苦', '寒', '肺、胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (74, '晚蚕沙', '祛风湿药', '甘、辛', '温', '肝、脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (75, '皂角子', '化痰止咳平喘药', '辛、咸', '温', '肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (76, '郁李仁', '泻下药', '辛、苦、甘', '平', '脾、大肠、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (77, '白术', '补虚药', '甘、苦', '温', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (78, '莱菔子', '消食药', '辛、甘', '平', '肺、脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (79, '莱菔英', '消食药', '辛、苦', '平', '肺、脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (80, '白豆蔻', '化湿药', '辛', '温', '肺、脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (81, '北沙参', '补虚药', '甘、苦', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (82, '丁香', '温里药', '辛', '温', '脾、胃、肺、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (83, '柿蒂', '理气药', '苦、涩', '平', '胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (84, '神曲', '消食药', '甘、辛', '温', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (85, '分心木', '补虚药', '苦、涩', '平', '脾、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (86, '绿萼梅', '理气药', '酸、涩', '平', '肝、肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (87, '生姜', '解表药', '辛', '温', '肺、脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (88, '藿香', '化湿药', '辛', '温', '脾、胃、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (89, '僵蚕', '平肝熄风药', '辛、咸', '平', '肝、肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (90, '白蒺藜', '平肝熄风药', '辛、苦', '温', '肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (91, '柴胡', '解表药', '苦、辛', '寒', '肝、胆', 0.000, 0.000);
INSERT INTO `drug` VALUES (92, '川芎', '活血化瘀药', '辛', '温', '肝、胆、心包', 0.000, 0.000);
INSERT INTO `drug` VALUES (93, '檀香', '理气药', '辛', '温', '脾、胃、心、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (94, '香附', '理气药', '辛、苦、甘', '平', '肝、脾、三焦', 0.000, 0.000);
INSERT INTO `drug` VALUES (95, '沉香', '理气药', '辛、苦', '温', '脾、胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (96, '竹茹', '化痰止咳平喘药', '甘', '寒', '心、肺、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (97, '紫苏', '解表药', '辛', '温', '肺、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (98, '扁豆衣', '补虚药', '甘', '温', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (99, '扁豆花', '化湿药', '甘', '平', '脾、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (100, '通草', '利水渗湿药', '甘、淡', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (101, '山楂', '消食药', '酸、甘', '温', '脾、胃、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (102, '槟榔', '驱虫药', '苦、辛', '温', '胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (103, '玫瑰花', '理气药', '甘、苦', '温', '肝、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (104, '藏红花', '活血化瘀药', '甘', '寒', '心、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (105, '佛手', '理气药', '辛、苦', '温', '肝、脾、胃、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (106, '干姜', '温里药', '辛', '热', '脾、胃、肺、肾、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (107, '石菖蒲', '开窍药', '辛、苦', '温', '心、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (108, '霞天曲', '化痰止咳平喘药', '辛', '温', '脾、胃、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (109, '高良姜', '温里药', '辛', '热', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (110, '刀豆子', '理气药', '甘', '温', '胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (111, '鹿角胶', '补虚药', '甘', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (112, '阿胶', '补虚药', '甘', '平', '肺、肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (113, '山茱萸', '收涩药', '酸、涩', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (114, '荆芥', '解表药', '辛', '温', '肺、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (115, '杜仲', '补虚药', '甘', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (116, '鸡血藤', '活血化瘀药', '苦、甘', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (117, '续断', '补虚药', '苦、辛', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (118, '熟地', '补虚药', '甘', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (119, '肉苁蓉', '补虚药', '甘、咸', '温', '肾、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (120, '黄芪', '补虚药', '甘', '温', '脾、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (121, '补骨脂', '补虚药', '苦、辛', '温', '肾、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (122, '枸杞', '补虚药', '甘', '平', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (123, '胡桃肉', '补虚药', '甘', '温', '肾、肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (124, '党参', '补虚药', '甘', '平', '脾、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (125, '茯苓', '利水渗湿药', '甘、淡', '平', '心、脾、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (126, '乌贼骨', '收涩药', '咸、涩', '温', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (127, '附子', '温里药', '辛、甘', '热', '心、脾、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (128, '荷叶', '化湿药', '苦、涩', '平', '心、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (129, '石斛', '补虚药', '甘', '寒', '胃、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (130, '乌梅', '收涩药', '酸、涩', '平', '肝、脾、肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (131, '木瓜', '祛风湿药', '酸', '温', '肝、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (132, '海浮石', '化痰止咳平喘药', '咸', '寒', '肺、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (133, '瓦楞子', '化痰止咳平喘药', '咸', '平', '肺、胃、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (134, '五味子', '收涩药', '酸、甘', '温', '肺、心、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (135, '荷叶蒂', '收涩药', '苦', '平', '脾、肝、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (136, '银柴胡', '清热药', '甘', '寒', '肝、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (137, '南沙参', '补虚药', '甘', '寒', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (138, '乳香', '活血化瘀药', '辛、苦', '温', '心、肝、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (139, '没药', '活血化瘀药', '辛、苦', '平', '心、肝、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (140, '滑石', '利水渗湿药', '甘、淡', '寒', '肺、胃、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (141, '车前子', '利水渗湿药', '甘', '寒', '肝、肺、肾、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (142, '葱白', '解表药', '辛', '温', '肺、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (143, '血余炭', '止血药', '苦', '平', '肝、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (144, '泽泻', '利水渗湿药', '甘', '寒', '肾、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (145, '大腹皮', '理气药', '辛', '温', '脾、胃、大肠、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (146, '远志', '安神药', '苦、辛', '温', '辛、肾、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (147, '莲肉', '收涩药', '甘、涩', '平', '脾、肾、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (148, '赤石脂', '收涩药', '甘、涩', '温', '大肠、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (149, '禹余粮', '收涩药', '甘、涩', '平', '胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (150, '乌药', '理气药', '辛', '温', '肺、脾、肾、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (151, '诃子', '收涩药', '苦、酸、涩', '平', '肺、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (152, '赤小豆', '利水渗湿药', '甘、酸', '寒', '心、小肠、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (153, '桂枝', '解表药', '辛、甘', '温', '心、肺、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (154, '红曲', '消食药', '甘', '温', '脾、大肠、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (155, '青皮', '理气药', '苦、辛', '温', '肝、胆、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (156, '白头翁', '清热药', '苦', '寒', '胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (157, '秦皮', '清热药', '苦、涩', '寒', '肝、胆、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (158, '椿皮', '收涩药', '苦、涩', '寒', '大肠、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (159, '山药', '补虚药', '甘', '平', '脾、肺、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (160, '石榴皮', '收涩药', '酸、涩', '温', '大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (161, '苦参', '清热药', '苦', '寒', '心、肝、大肠、胃、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (162, '地榆', '止血药', '苦、酸、涩', '寒', '肝、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (163, '龙骨', '安神药', '甘、涩', '平', '心、肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (164, '牡蛎', '平肝熄风药', '咸', '寒', '肝、胆、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (165, '浮小麦', '收涩药', '甘', '凉', '心', 0.000, 0.000);
INSERT INTO `drug` VALUES (166, '茯神', '利水渗湿药', '甘、淡', '平', '心、脾、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (167, '荷梗', '化湿药', '苦', '平', '脾、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (168, '肉豆蔻', '收涩药', '辛', '温', '脾、胃、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (169, '车前草', '利水渗湿药', '甘', '寒', '肝、肾、肺、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (170, '旱莲草', '补虚药', '甘、酸', '寒', '肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (171, '罂粟壳', '收涩药', '酸、涩', '平', '肺、大肠、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (172, '木香', '理气药', '辛、苦', '温', '脾、胃、大肠、胆、三焦', 0.000, 0.000);
INSERT INTO `drug` VALUES (173, '重楼', '清热药', '苦', '寒', '肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (174, '川贝母', '化痰止咳平喘药', '苦、甘', '寒', '心、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (175, '橘红', '理气药', '辛、苦', '温', '肺、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (176, '朱砂', '安神药', '甘', '寒', '心', 0.000, 0.000);
INSERT INTO `drug` VALUES (177, '雄黄', '攻毒杀虫止痒药', '辛', '温', '肝、大肠、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (178, '麝香', '开窍药', '辛', '温', '心、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (179, '人参', '补虚药', '甘、苦', '温', '肺、脾、心', 0.000, 0.000);
INSERT INTO `drug` VALUES (180, '槐米', '止血药', '苦', '寒', '肝、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (181, '白前', '化痰止咳平喘药', '辛、苦', '温', '肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (182, '紫菀', '化痰止咳平喘药', '苦、辛、甘', '温', '肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (183, '百部', '化痰止咳平喘药', '甘、苦', '温', '肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (184, '白石脂', '收涩药', '甘、涩', '温', '大肠、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (185, '天生磺', '攻毒杀虫止痒药', '酸', '温', '肾、大肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (186, '白芨', '止血药', '苦、甘、涩', '寒', '肺、肝、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (187, '橘络', '理气药', '甘、苦', '平', '肝、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (188, '紫河车', '补虚药', '甘、咸', '温', '肺、肝、肾', 0.000, 0.000);
INSERT INTO `drug` VALUES (189, '龙涎香', '理气药', '甘、酸', '温', '肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (190, '琥珀', '安神药', '甘', '平', '心、肝、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (191, '酸枣仁', '安神药', '甘、酸', '平', '心、肝、胆', 0.000, 0.000);
INSERT INTO `drug` VALUES (192, '糯米', '补虚药', '甘', '温', '脾、胃、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (193, '木耳炭', '补虚药', '甘', '平', '脾、大肠、肝、肺', 0.000, 0.000);
INSERT INTO `drug` VALUES (194, '柿饼炭', '收涩药', '甘、涩', '寒', '肺、大肠、脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (195, '仙鹤草', '止血药', '苦、涩', '平', '心、肝', 0.000, 0.000);
INSERT INTO `drug` VALUES (196, '灶心土', '止血药', '辛', '温', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (197, '冬瓜子', '利水渗湿药', '甘', '凉', '脾、小肠', 0.000, 0.000);
INSERT INTO `drug` VALUES (198, '冬葵子', '利水渗湿药', '甘、涩', '凉', '大肠、小肠、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (199, '猪苓', '利水渗湿药', '甘、淡', '平', '肾、膀胱', 0.000, 0.000);
INSERT INTO `drug` VALUES (200, '豆黄卷', '解表药', '甘、淡', '平', '脾、胃', 0.000, 0.000);
INSERT INTO `drug` VALUES (201, '茵陈', '利水渗湿药', '苦、辛', '寒', '脾、胃、肝、胆', 0.000, 0.000);
INSERT INTO `drug` VALUES (202, '延胡索', '活血化瘀药', '辛、苦', '温', '心、肝、脾', 0.000, 0.000);
INSERT INTO `drug` VALUES (203, '败酱草', '清热药', '辛、苦', '寒', '胃、大肠、肝', 0.000, 0.000);
COMMIT;

-- ----------------------------
-- Table structure for famrecord
-- ----------------------------
DROP TABLE IF EXISTS `famrecord`;
CREATE TABLE `famrecord` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `sex` varchar(25) DEFAULT NULL,
  `age` varchar(25) DEFAULT NULL,
  `frequ` varchar(25) DEFAULT NULL,
  `chcom` text,
  `symptom` text,
  `zdiagnosis` text,
  `xdiagnosis` text,
  `tonfur` varchar(50) DEFAULT NULL,
  `pulse` varchar(50) DEFAULT NULL,
  `dialetype` text,
  `cercate` text,
  `rule` text,
  `drugs` longtext,
  `count` varchar(25) DEFAULT NULL,
  `prescription` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of famrecord
-- ----------------------------
BEGIN;
INSERT INTO `famrecord` VALUES (1, '赵某', '男', '19', '1', '口中生疮', '齿龈红肿疼痛，流涎，便秘', '口疮', '口腔溃疡', '黄', '数', '胃热证', '胃热', '清胃泻火', '蒲公英9，牛蒡子6，甘草4.5，马勃4.5，硼砂1.5，青黛3，金银花9，连翘9，黄芩6，栀子4.5，大黄4.5，瓜蒌18，芒硝4.5，薄荷4.5，玄参12，桔梗4.5，浙贝母6', '17', '凉膈散');
INSERT INTO `famrecord` VALUES (2, '王某', '女', '10', '1', '齿龈红肿疼痛，出血', '口中生疮', '牙疳', '牙龈炎', '黄', '数', '胃热证', '胃热', '清胃泻火', '龙胆草2，黄芩4.5，蒲黄4.5，黄柏4.5，牛膝6，黄连3，栀子4.5，马勃4.5，硼砂1.5，桔梗4.5，金银花9，薏苡仁6，佩兰9，甘草4.5，生地9，细辛0.6，牡丹皮6，当归4.5，赤芍6，川楝子6', '20', '黄连解毒汤、清胃散');
INSERT INTO `famrecord` VALUES (3, '胡某', '女', '20', '1', '口腔内满布白色斑点', '齿龈红肿疼痛，不能进食', '口糜', '口腔白色念珠菌病', '黄', '数', '胃热证', '胃热', '清胃泻火', '芦荟4.5，石膏15，麦冬6，金果榄9，甘草6，当归6，栀子6，黄连4.5，黄柏4.5，黄芩6，大黄炭4.5，知母6，佩兰9，天花粉9，玄参12，山豆根4.5', '16', '当归龙荟汤、白虎汤');
INSERT INTO `famrecord` VALUES (4, '范某', '女', '48', '1', '齿龈红肿疼痛，口中生疮', '头晕，便秘，小便黄，失眠', '口疮', '口腔溃疡', '黄', '数', '胃热证', '胃热', '清胃泻火', '升麻3，细辛3，黄连3，栀子6，生地10，黄芩10，牛蒡子6，大黄炭6，连翘10，桔梗5，枳壳5，金银花15，黄柏10，炙甘草3', '14', '清胃泻火汤、甘桔汤');
INSERT INTO `famrecord` VALUES (5, '范某', '女', '48', '2', '齿龈红肿疼痛，口中生疮', '头晕，便秘，小便黄，失眠', '口疮', '口腔溃疡', '黄', '数', '胃热证', '胃热', '清胃泻火', '升麻3，细辛3，黄连3，栀子6，生地10，黄芩10，牛蒡子6，大黄炭6，连翘10，桔梗5，枳实6，金银花15，炙甘草3，蒲公英15', '14', '清胃泻火汤、甘桔汤');
INSERT INTO `famrecord` VALUES (6, '魏某', '男', '33', '1', '咽部红肿疼痛', '发热，头身疼痛，口干渴', '咽痛', '急性咽峡炎', '黄', '数', '表热证', NULL, '疏风解表，清热泻火', '芦根30，白茅根15，蔓荆子4.5，薄荷4.5，桑叶6，桑枝18，蒲公英9，牛蒡子6，甘草4.5，马勃4.5，青黛3，桔梗4.5，淡豆豉12，枳壳4.5，杏仁6，薤白6，金银花9，连翘9，栀子4.5', '19', '银翘散');
INSERT INTO `famrecord` VALUES (7, '魏某', '男', '33', '2', '咽部红肿疼痛', '便秘，食欲不振', '咽痛', '急性咽峡炎', '黄', '数', '表热证', NULL, '疏风解表，清热泻火', '山慈菇9，蒲公英9，牛蒡子6，连翘9，锦灯笼6，金果榄9，浙贝母6，马勃4.5，青黛3，枳壳4.5，大黄炭4.5，瓜蒌18，芒硝6，杏仁6，桑叶6，黄芩6，板蓝根6，薤白6，厚朴4.5，代代花4.5，鸡内金9，谷芽9，麦芽9，佩兰9，甘草6，薄荷4.5', '26', '银翘散');
INSERT INTO `famrecord` VALUES (8, '孙某', '男', '35', '1', '噎膈，食入不下，咽下困难，呕吐', '消瘦', '噎膈', '食管狭窄', '白', '细', '胃气虚证', '气逆', '益气降逆', '旋覆花6，代赭石15，茜草6，牛膝9，丹参15，白芝麻30，吴茱萸6，黄连24，西洋参4.5，桃仁6，杏仁6，谷芽9，麦芽9，白扁豆30，薤白6，半夏9', '16', '旋覆代赭汤、左金丸、薤白半夏汤');
INSERT INTO `famrecord` VALUES (9, '崔某', '男', '40', '1', '噎膈，食入不下，咽下困难', '咽部红肿疼痛', '噎膈', '食管炎', '红', '数', '胃热证', '气逆', '清热降逆', '旋覆花4.5，代赭石12，蒲公英9，牛蒡子6，丹参12，薤白6，桔梗4.5，枳椇子6，葛花6，黄芩6，甘草3，茜草6，郁金4.5，砂仁4.5，赤芍6，白芍6', '16', '旋覆代赭汤');
INSERT INTO `famrecord` VALUES (10, '贾某', '男', '79', '1', '噎膈，食入不下，咽下困难', '情志抑郁，胸闷胀痛，口干渴，不欲饮水，便秘，大便数日一行，乏力，失眠', '噎膈', '食管狭窄', '燥', '沉、涩', '胃阴虚证', '阴亏、气滞、气逆', '滋阴润燥，行气降逆', '薤白10，桃仁6，代赭石15，旋覆花6，瓜蒌18，杏仁6，半夏10，枳实6，火麻仁15，当归12，牛膝10，茜草10，郁金10，陈皮6，麦冬6，天冬6', '16', '旋覆代赭汤、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (11, '贾某', '男', '79', '2', '噎膈，食入不下，咽下困难', '胸闷，胃脘胀满疼痛，口干渴，不欲饮水，便秘，大便数日一行，乏力，失眠', '噎膈', '食管狭窄', '燥', '沉、涩', '胃阴虚证', '阴亏、气滞、气逆', '滋阴润燥，行气降逆', '薤白10，桃仁6，代赭石15，旋覆花6，瓜蒌18，杏仁6，半夏10，枳实6，火麻仁15，当归12，牛膝10，茜草10，郁金10，陈皮6，麦冬6，天冬6，晚蚕沙10，皂角子10', '18', '旋覆代赭汤、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (12, '贾某', '男', '79', '3', '噎膈，食入不下，咽下困难', '胸闷，胃脘胀满疼痛，乏力，便秘', '噎膈', '食管狭窄', '燥', '沉、涩', '胃阴虚证', '阴亏、气滞、气逆', '滋阴润燥，行气降逆', '薤白10，瓜蒌25，代赭石12，旋覆花10，晚蚕沙10，皂角子10，枳实6，茜草10，牛膝10，桃仁6，杏仁6，郁李仁8，火麻仁8，郁金10，当归12，白术10', '16', '旋覆代赭汤、瓜蒌薤白散');
INSERT INTO `famrecord` VALUES (13, '程某', '男', '65', '1', '噎膈，食入不下，咽下困难，呕吐', '嗳气，胃脘胀满疼痛', '噎膈', '食管狭窄', '薄、腻', '沉、涩', '食滞胃脘证', '气逆、气滞、食积', '降逆行气消积', '薤白10，莱菔子6，代赭石15，旋覆花6，瓜蒌20，莱菔英6，牛膝10，丹参12，陈皮炭6，砂仁8，厚朴6，桃仁6，白豆蔻3，枳壳5，杏仁6，北沙参3，鸡内金10，白芝麻30', '18', '旋覆代赭汤、瓜蒌薤白散、丹参饮、');
INSERT INTO `famrecord` VALUES (14, '程某', '男', '65', '2', '噎膈，食入不下，咽下困难', '嗳气，胃脘胀满疼痛', '噎膈', '食管狭窄', '薄、腻', '沉、涩', '食滞胃脘证', '气逆、气滞、食积', '降逆行气消积', '薤白10，莱菔子6，代赭石15，旋覆花6，瓜蒌20，莱菔英6，丹参12，陈皮炭6，砂仁8，厚朴6，桃仁6，白豆蔻3，枳壳5，杏仁6，白芝麻30，丁香2，柿蒂6，茜草6', '18', '旋覆代赭汤、瓜蒌薤白散、丹参饮');
INSERT INTO `famrecord` VALUES (15, '程某', '男', '65', '3', '噎膈，食入不下，咽下困难', '嗳气，胃脘胀满疼痛', '噎膈', '食管狭窄', '薄、腻', '沉、涩', '食滞胃脘证', '气逆、气滞、食积', '降逆行气消积', '薤白10，半夏曲6，代赭石10，旋覆花6，瓜蒌20，神曲6，火麻仁15，分心木10，杏仁6，莱菔子6，桔梗6，陈皮炭6，莱菔英6，枳壳5，甘草6，白芝麻30', '16', '旋覆代赭汤、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (16, '常某', '男', '38', '1', '噎膈，食入不下，咽下困难', '胃脘胀满疼痛，反酸，嗳气，痰多，背痛，乏力', '噎膈', '食管癌', '腻', '细', '痰气交阻证', '气逆、气滞', '降逆行气，活血化瘀', '桃仁6，杏仁6，牛蒡子6，半夏6，牛膝10，厚朴5，桔梗5，薤白10，莱菔子6，代赭石12，旋覆花6，瓜蒌20，莱菔英6，茜草10，丹参15，陈皮炭6', '16', '旋覆代赭汤、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (17, '常某', '男', '38', '2', '噎膈，食入不下，咽下困难', '胃脘胀满疼痛，反酸，嗳气，痰多，背痛', '噎膈', '食管癌', '腻', '细', '痰气交阻证', '气逆、气滞', '降逆行气，活血化瘀', '薤白10，瓜蒌25，桃仁6，杏仁6，厚朴5，半夏6，代赭石12，旋覆花6，茜草10，丹参15，牛膝6，牛蒡子6，山慈菇10，绿萼梅6', '14', '旋覆代赭汤、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (18, '于某', '女', '42', '1', '呕吐', '胸闷，嗳气，头痛', '呕吐', '胃痉挛', '黄', '弦、滑', '胃气虚证', '气逆', '降逆行气，和胃止呕', '白术4.5，吴茱萸3，黄连1.5，西洋参4.5，生姜3，旋覆花6，代赭石9，半夏9，藿香4.5，桔梗4.5，陈皮炭9，牛膝9，枳壳4.5，瓜蒌18，薤白6，鸡内金9，晚蚕沙9，皂角子9，僵蚕6，白蒺藜12', '20', '旋覆代赭汤、左金丸、瓜蒌薤白散');
INSERT INTO `famrecord` VALUES (19, '张某', '男', '38', '1', '胁肋胀满疼痛', '食欲不振，嗳气，反酸，呕吐，便秘，身倦，乏力，背痛，失眠', '胁痛', '肝硬化', '白', '弦', '肝胃不和证', '气滞', '疏肝理气，和胃', '柴胡5，薤白10，丹参25，白芍10，瓜蒌20，砂仁5，枳壳6，川芎5，檀香3，香附10，陈皮炭6，甘草3，半夏曲6，沉香曲6，旋覆花6，代赭石12', '16', '柴胡疏肝散、丹参饮、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (20, '杨某', '女', '18', '1', '呕吐，胃脘胀满疼痛', '嗳气，大便溏，小便黄，乏力，失眠', '胃痛', '急性胃炎', '薄、腻', '沉、弦', '食滞胃脘证', '气逆', '降逆行气，消积，和胃止呕', '香附10，竹茹6，半夏10，紫苏5，吴茱萸1，砂仁3，藿香5，黄连2.4，白豆蔻3，檀香5，丹参12，鸡内金10，陈皮炭6，枳实5，甘草3', '15', '左金丸、温胆汤、丹参饮、香苏散');
INSERT INTO `famrecord` VALUES (21, '钱某', '女', '20', '1', '呕吐，胃脘胀满疼痛', '胸闷，食欲不振，大便溏', '胃痛', '急性胃炎', '薄、腻', '弦', '寒滞胃脘证', '寒、气逆、食积', '温胃散寒，行气止痛，止呕', '砂仁4.5，白豆蔻4.5，神曲6，半夏曲6，香附6，紫苏4.5，藿香4.5，厚朴4.5，陈皮炭9，吴茱萸6，黄连24，竹茹6，佩兰9，扁豆衣6，扁豆花6，鸡内金9，通草4.5，枳壳4.5，檀香3，丹参12', '20', '左金丸、温胆汤、丹参饮、香苏散');
INSERT INTO `famrecord` VALUES (22, '钱某', '女', '20', '2', '呕吐，胃脘胀满疼痛', '胸闷，食欲不振', '胃痛', '急性胃炎', '薄、腻', '弦、滑', '食滞胃脘证', '气逆、食积', '降逆行气，消积，和胃止呕', '厚朴4.5，代代花4.5，砂仁4.5，白豆蔻4.5，神曲6，半夏曲6，枳壳4.5，谷芽9，麦芽9，鸡内金9，陈皮炭9，山楂9，槟榔9，佩兰3，杏仁6，白术3，莱菔子4.5，莱菔英9', '18', '四消饮');
INSERT INTO `famrecord` VALUES (23, '周某', '女', '40', '1', '胃脘胀满疼痛', '嘈杂，反酸，嗳气，食欲不振，便秘', '胃痛', '慢性胃炎', '薄、腻', '弦、滑', '食滞胃脘证', '气逆、食积', '降逆行气消痞', '旋覆花6，代赭石9，桃仁6，杏仁6，丹参9，玫瑰花4.5，代代花4.5，厚朴4.5，晚蚕沙9，皂角子9，藏红花1.5，瓜蒌18，薤白9，枳壳4.5，神曲6，半夏曲6，香附6，紫苏4.5，桔梗4.5，吴茱萸0.6，黄连2.4，佩兰9，鸡内金9，谷芽9，麦芽9', '25', '香苏散，旋覆代赭汤，西红汤，瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (24, '周某', '女', '40', '2', '胃脘胀满疼痛', '胸闷，食欲不振', '胃痛', '慢性胃炎', '薄、腻', '弦、滑', '食滞胃脘证', '气逆、食积', '降逆行气消痞', '旋覆花6，代赭石9，厚朴4.5，枳壳4.5，桃仁6，杏仁6，黄连4.5，吴茱萸4.5，半夏曲6，桔梗4.5，鸡内金9，丹参9，陈皮炭9，佛手4.5，代代花4.5，莱菔子4.5，莱菔英9，薤白6，佩兰9，谷芽15，砂仁4.5，白豆蔻4.5，甘草1.5，茜草6', '24', '旋覆代赭汤、左金丸、薤白半夏汤');
INSERT INTO `famrecord` VALUES (25, '周某', '女', '40', '3', '胃脘胀满疼痛', '胸闷', '胃痛', '慢性胃炎', '薄、腻', '弦、滑', '食滞胃脘证', '气逆、食积', '降逆行气消痞', '干姜炭15，吴茱萸15，黄连15，麦芽60，龙胆草15，西洋参15，石菖蒲15，白术15，藏红花9，白豆蔻12，丹参15，陈皮15，薤白15，鸡内金15，霞天曲15，厚朴15，槟榔15，大黄15，甘草15，枳实15', '20', '西红汤、左金丸');
INSERT INTO `famrecord` VALUES (26, '王某', '女', '47', '1', '胃脘胀满疼痛', '食欲不振，呕吐，便秘', '痞满', '慢性胃炎', '白', '细、弱', '脾胃气虚证', '气虚', '补气健脾，行气消痞', '白扁豆24，白术4.5，北沙参9，天花粉9，鸡内金9，谷芽9，麦芽9，厚朴4.5，代代花4.5，佛手4.5，玫瑰花4.5，陈皮炭9，佩兰9，神曲6，吴茱萸0.6，黄连2.4，白芍9，干姜0.9，郁金4.5,', '19', '理中丸、左金丸');
INSERT INTO `famrecord` VALUES (27, '王某', '女', '47', '2', '胃脘胀满疼痛', '便秘', '痞满', '慢性胃炎', '白', '细、弱', '脾胃气虚证', '气虚', '补气健脾，润肠', '白术4.5，玫瑰花4.5，代代花4.5，白芍9，桔梗4.5，枳壳4.5，杏仁4.5，薤白9，火麻仁12，当归9，鸡内金9，谷芽9，麦芽9，佩兰9，陈皮9，晚蚕沙9，皂角子9，神曲6', '18', '麻子仁丸');
INSERT INTO `famrecord` VALUES (28, '王某', '女', '47', '3', '胃脘胀满疼痛', NULL, '痞满', '慢性胃炎', '白', '细、弱', '脾胃气虚证', '气虚', '补气健脾，行气消痞', '白术30，麦芽60，高良姜15，刀豆子15，石菖蒲15，丹参15，吴茱萸15，黄连15，陈皮15，鸡内金15，白豆蔻9，砂仁15，薤白15，枳实15，半夏15，西洋参15，龙胆草15，郁金15，厚朴15，甘草15，芒硝15', '21', '枳实薤白半夏汤、左金丸、理中丸');
INSERT INTO `famrecord` VALUES (29, '齐某', '男', '42', '1', '胃脘痛，便血', '腰痛，便秘', '便血', '消化性溃疡', '白', '沉、弦', '肝肾亏虚证', NULL, '补益肝肾，止血', '鹿角胶6，阿胶10，黑芝麻5，山茱萸12，火麻仁10，荆芥5，杜仲10，生地炭15，鸡血藤15，续断10，熟地炭15，白芍18，当归10，枳壳6，肉苁蓉10，甘草10', '16', '青娥丸，二仙胶');
INSERT INTO `famrecord` VALUES (30, '齐某', '男', '42', '2', '胃脘痛，便血', '腰痛，腹中肠鸣', '便血', '消化性溃疡', '白', '沉、弦', '肝肾亏虚证', NULL, '补益肝肾，止血', '杜仲10，升麻5，生地炭18，续断10，荆芥5，熟地炭18，二仙胶15，肉苁蓉15，山茱萸12，白芍10，当归10，黄芪18，枳壳6，白术6，甘草10', '15', '二仙胶');
INSERT INTO `famrecord` VALUES (31, '齐某', '男', '42', '3', '腹中肠鸣', NULL, '便血', '消化性溃疡', '白', '沉、弦', '肝肾亏虚证', NULL, '补益肝肾，止血', '补骨脂10，二仙胶15，枸杞15，杜仲10，生地炭18，当归6，续断10，熟地炭18，枳壳6，胡桃肉30，山茱萸12，黄芪18，神曲10，白术6，甘草10', '15', '青娥丸、二仙胶');
INSERT INTO `famrecord` VALUES (32, '何某', '男', '23', '1', '胃脘痛，便血', '食欲不振，乏力', '便血', '消化性溃疡', '白、腻', '弦', '寒湿困脾证', '气虚', '化湿，补气健脾', '党参10，白术10，代赭石15，旋覆花6，茯苓10，甘草6，白芍12，丹参18，砂仁3，白豆蔻3，柴胡5，檀香5', '12', '四君子汤、旋覆代赭汤、丹参饮');
INSERT INTO `famrecord` VALUES (33, '何某', '男', '23', '2', '胃脘痛', '食欲不振，反酸', '胃痛', '消化性溃疡', '白、腻', '弦', '寒湿困脾证', '气虚', '化湿，补气健脾', '党参12，白术10，半夏曲6，丹参12，鸡内金10，沉香曲6，茯苓12，陈皮炭6，厚朴5，砂仁5，乌贼骨6，甘草10', '12', '四君子汤');
INSERT INTO `famrecord` VALUES (34, '王某', '男', '40', '1', '胃脘痛，便血', '腹胀，食欲不振，便秘', '胃痛', '消化性溃疡', '黄、腻', '弦、数', '气滞证', '气滞', '行气和胃', '白芍15，火麻仁15，枳壳6，莱菔子6，香附10，桃仁10，杏仁10，莱菔英6，丹参15，厚朴5，炙甘草6', '11', '芍药甘草汤、麻子仁丸');
INSERT INTO `famrecord` VALUES (35, '王某', '男', '40', '2', '胃脘痛，便血', '食欲不振，便秘', '胃痛', '消化性溃疡', '黄、腻', '弦、数', '气滞证', '气滞', '行气和胃', '白芍12，甘草10，白术10，枳壳5，茯苓10，晚蚕沙10，皂角子6，厚朴5，佩兰10，火麻仁15，丹参15', '11', '芍药甘草汤');
INSERT INTO `famrecord` VALUES (36, '王某', '男', '40', '3', '胃脘痛，胀满', NULL, '胃痛', '消化性溃疡', '白', '沉、弱', '脾胃气虚证', '气虚', '补气健脾，调养脾胃', '党参10，沉香曲6，砂仁3，白术10，半夏曲6，白豆蔻3，茯苓10，陈皮炭6，香附10，厚朴5，枳壳5，火麻仁12，甘草6', '13', '香砂六君子汤');
INSERT INTO `famrecord` VALUES (37, '时某', '男', '52', '1', '胃脘痛', '嗳气，反酸，嘈杂，呕吐', '胃痛', '消化性溃疡', '白', '沉、弱', '脾胃虚寒证', '虚寒', '温中散寒，行气止痛', '干姜炭6，高良姜5，附子6，砂仁3，白豆蔻3，檀香5，代赭石12，旋覆花6，厚朴5，刀豆子12，白术10，党参10，甘草3', '13', '旋覆代赭汤、附子理中汤、二姜丸');
INSERT INTO `famrecord` VALUES (38, '时某', '男', '52', '2', '胃脘痛', '嗳气，反酸，嘈杂，呕吐', '胃痛', '消化性溃疡', '白', '沉、弱', '脾胃虚寒证', '虚寒', '温中散寒、行气止痛', '附子10，党参12，茯苓10，干姜炭5，砂仁3，代赭石12，旋覆花6，高良姜5，白豆蔻3，白术10，陈皮炭6，厚朴5，甘草5，丁香1.8，檀香1.8', '15', '旋覆代赭汤、附子理中汤、二姜丸');
INSERT INTO `famrecord` VALUES (39, '闫某', '男', '27', '1', '胃脘胀满', '嗳气，食欲不振，便秘，头晕，乏力', '痞满', '胃下垂', '白', '细', '脾胃气虚证', '气虚', '补气健脾', '黄芪15，升麻5，神曲6，甘草3，柴胡5，半夏曲6，党参10，白术10，当归12，茯苓10，砂仁5，桔梗5，荷叶6，陈皮5', '14', '补中益气汤、香砂六君子汤');
INSERT INTO `famrecord` VALUES (40, '曲某', '男', '30', '1', '胃脘胀满，呃逆', '食欲不振，便秘', '呃逆', '膈肌痉挛', '白', '沉、弦', '胃气虚证', '气虚、气逆', '降逆行气，和胃', '白芝麻30，丁香3，柿蒂7，厚朴6，枳壳5，代赭石10，旋覆花6，代代花6，陈皮5，党参10，半夏10，茯苓10，荷叶6', '13', '丁香柿蒂汤、旋覆代赭汤');
INSERT INTO `famrecord` VALUES (41, '秦某', '男', '45', '1', '食欲不振', '乏力', '胃呆', '慢性胃炎', '白', '细', '胃阴虚证', '阴亏', '益气养阴，生津', '北沙参10，石斛12，谷芽10，麦芽10，鸡内金10，白术10，绿萼梅10，乌梅5，荷叶6，木瓜10', '10', NULL);
INSERT INTO `famrecord` VALUES (42, '陈某', '男', '34', '1', '胃脘胀满，反酸，嗳气，嘈杂', '呕吐，便秘', '嘈杂', '慢性胃炎', '白', '弦', '气滞证', '气滞', '调理气机，降逆行气', '旋覆花6，代赭石12，白术4.5，吴茱萸1.5，黄连3，藿香4.5，桔梗4.5，神曲6，枳壳4.5，陈皮炭9，丹参12，砂仁4.5，白豆蔻4.5，鸡内金9，瓜蒌18，芒硝4.5，半夏9，西洋参4.5，扁豆衣9，扁豆花9，厚朴4.5，代代花4.5，薤白9，谷芽12', '24', '旋覆代赭汤、左金丸、瓜蒌薤白半夏汤');
INSERT INTO `famrecord` VALUES (43, '孙某', '女', '60', '1', '胃脘胀满，反酸，嘈杂', '便秘', '嘈杂', '慢性胃炎', '白', '弦', '气滞证', '气滞', '调理气机，抑酸止痛', '海浮石9，瓦楞子15，旋覆花6，代赭石9，丹参9，瓜蒌18，芒硝4.5，晚蚕沙9，皂角子9，枳实炭4.5，陈皮炭9，鸡内金炭9，神曲炭6，薤白6，吴茱萸0.6，黄连2.4，龙胆草1.5，桃仁6，杏仁6，香附炭6，桔梗4.5', '21', '旋覆代赭汤、瓜蒌薤白散、左金丸');
INSERT INTO `famrecord` VALUES (44, '高某', '女', '40', '1', '食欲不振', '胃脘胀满，嗳气', '胃呆', '慢性胃炎', '白', '细', '胃阴虚证', '阴亏', '益气养阴，生津', '乌梅炭4.5，木瓜6，五味子3，山楂9，白芍12，白术3，北沙参9，瓜蒌9，佩兰9，代代花4.5，玫瑰花4.5，石斛12，郁金4.5，西洋参3', '14', NULL);
INSERT INTO `famrecord` VALUES (45, '萨某', '男', '60', '1', '胃脘胀满，呃逆', '便秘', '呃逆', '膈肌痉挛', '白', '沉、弦', '胃气虚证', '气逆', '降逆行气，和胃', '晚蚕沙9、皂角子9、半夏9、黑芝麻9、白芝麻9、杏仁6、荷叶6、桔梗4.5、枳壳4.5、丁香3、荷叶蒂7枚、薤白6、旋覆花4.5、代赭石9、柿蒂7枚、瓜蒌18、佩兰9、厚朴4.5、代代花4.5、陈皮9', '20', '丁香柿蒂汤、旋覆代赭汤');
INSERT INTO `famrecord` VALUES (46, '萨某', '男', '60', '2', '胃脘胀满，呃逆', NULL, '呃逆', '膈肌痉挛', '白', '沉、弦', '胃气虚证', '气逆', '降逆行气、和胃', '赤芍6、白芍6、银柴胡4.5、晚蚕沙9、皂角子9、西洋参4.5、杏仁6、半夏9、陈皮9、枳壳4.5、桔梗4.5、薤白6、鸡内金9、荷叶蒂7枚、南沙参6、北沙参6、黑芝麻15、白芝麻15、芦根1尺、柿蒂7枚', '20', '益胃汤');
INSERT INTO `famrecord` VALUES (47, '夏某', '女', '46', '1', '胃脘痛，呕吐，便血', '嗳气，胃脘胀满，消谷善饥，口干渴', '吐血', '胃溃疡', '绛', '数', '胃热证', '气逆', '清胃泻火，化瘀止血', '生地9、熟地9、薤白6、蒲公英9、丹参12、乳香9、没药9、金银花12、薏苡仁12、桔梗4.5、旋覆花6、代赭石12、黄连3、桃仁6、杏仁6、甘草3、白芍12', '17', '旋覆代赭汤、左金丸');
INSERT INTO `famrecord` VALUES (48, '姚某', '男', '43', '1', '腹痛，腹泻', '恶寒发热，乏力', '泄泻', '急性肠炎', '白、腻', '濡、数', '寒湿证', NULL, '散寒化湿', '紫苏5，苍术炭6，滑石10，车前子10，藿香5，白术炭6，淡豆豉10，桑叶6，厚朴炭6，陈皮炭10，甘草3，薏苡仁15，葱白3，生姜6', '14', '藿香正气散');
INSERT INTO `famrecord` VALUES (49, '沈某', '男', '37', '1', '腹痛，腹泻', '胃脘胀满，食欲不振', '泄泻', '急性肠炎', '薄、腻', '滑', '食滞胃脘证', '食积', '消食导滞，和胃止泻', '车前子9，血余炭9，滑石12，厚朴4.5，山楂18，麦芽18，神曲18，香附6，鸡内金9，晚蚕沙9，黄连4.5，吴茱萸4.5，泽泻9，陈皮炭9，薏苡仁12，大腹皮9，枳壳4.5，甘草4.5，通草4.5', '19', '保和丸、左金丸');
INSERT INTO `famrecord` VALUES (50, '沈某', '男', '37', '2', '腹痛，腹泻', '胃脘胀满，不欲饮食', '泄泻', '急性肠炎', '薄、腻', '滑', '食滞胃脘证', '食积', '消食导滞，和胃止泻', '车前子9，血余炭9，黄连6，吴茱萸6，苍术炭6，薏苡仁12，厚朴4.5，香附6，谷芽9，麦芽9，槟榔9，山楂炭9，神曲6，鸡内金9，枳壳4.5，陈皮炭9，茯苓9，通草4.5', '18', '保和丸、左金丸');
INSERT INTO `famrecord` VALUES (51, '沈某', '男', '37', '3', '食欲不振', NULL, '泄泻', '急性肠炎', '薄、腻', '滑', '食滞胃脘证', '食积', '消食导滞，和胃', '代代花4.5，厚朴4.5，佩兰9，白芍9，远志9，西洋参4.5，谷芽15，白术3，茯苓9，鸡内金9，木瓜6，乌梅4.5，甘草3', '13', NULL);
INSERT INTO `famrecord` VALUES (52, '胡某', '男', '42', '1', '腹痛，腹泻', '腹部下坠，食欲不振，乏力', '泄泻', '慢性肠炎', '白', '细、弱', '脾胃气虚证', '气虚', '补气健脾，化湿止泻', '血余炭9，黄连4.5，吴茱萸4.5，白芍12，柴胡4.5，乌药4.5，香附6，苍术炭6，薏苡仁12，石莲肉9，建莲肉9，陈皮炭9，车前子9，茯苓9，厚朴4.5，甘草3，通草4.5', '17', '左金丸、参苓白术散');
INSERT INTO `famrecord` VALUES (53, '胡某', '男', '42', '2', '腹痛，腹泻', '气短，乏力', '泄泻', '慢性肠炎', '白', '细、弱', '脾肾两虚证', NULL, '补脾益肾，温阳止泻', '附子4.5，干姜炭1.5，白术4.5，党参9，石莲肉9，建莲肉9，吴茱萸3，黄连9，血余炭9，五味子3，补骨脂4.5，肉豆蔻4.5，甘草3，白芍12，柴胡4.5，乌药4.5，苍术炭6，薏苡仁12', '18', '左金丸、附子理中汤、四神丸');
INSERT INTO `famrecord` VALUES (54, '胡某', '男', '42', '3', '腹痛，腹泻', '乏力', '泄泻', '慢性肠炎', '白', '细、弱', '脾肾两虚证', NULL, '补益脾肾，温阳止泻', '血余炭9，赤石脂9，黄连6，吴茱萸6，禹余粮9，附子4.5，干姜1.5，白术4.5，党参9，五味子3，补骨脂4.5，肉豆蔻4.5，石莲肉9，建莲肉9，苍术炭6，薏苡仁12，乌药4.5，诃子6，甘草3', '19', '左金丸、附子理中汤、四神丸、赤石脂禹余粮丸');
INSERT INTO `famrecord` VALUES (55, '马某', '男', '70', '1', '腹痛，腹泻', '腹部下坠，恶寒发热，食欲不振', '泄泻', '急性肠炎', '黄、腻', '弦、数', '湿热证', NULL, '清热燥湿，分利止泻', '黄芩6，苍术炭6，血余炭6，车前子6，黄连5，白术炭6，葛根10，鸡内金10，甘草3，通草5，薏苡仁15，淡豆豉10，赤小豆10，茯苓10', '14', '葛根黄芩黄连汤');
INSERT INTO `famrecord` VALUES (56, '杜某', '男', '26', '1', '腹痛，痢下脓血', '里急后重，恶寒发热，头痛，食欲不振，小便短赤', '痢疾', '阿米巴痢疾', '黄、腻', '滑', '湿热证', '湿、食积', '清热燥湿，解表', '桂枝3，赤芍6，白芍6，银柴胡3，淡豆豉12，吴茱萸5，黄连5，蔓荆子6，茯苓10，葛根10，赤小豆20，炒红曲6，车前子10，厚朴5，山楂炭10，枳壳5，甘草3，晚蚕沙6，血余炭6', '19', '芍药汤、左金丸');
INSERT INTO `famrecord` VALUES (57, '杜某', '男 ', '26', '2', '腹痛，痢下脓血', '小便短赤', '痢疾', '阿米巴痢疾', '黄、腻', '滑', '湿热证', '湿、食积', '清热燥湿，消积导滞', '苍术炭6，茯苓10，青皮炭5，白术炭6，赤小豆20，陈皮炭5，扁豆衣6，血余炭6，车前子10，扁豆花6，吴茱萸5，黄连5，黄芩6，神曲10，薏苡仁15，厚朴5，葛根10，甘草3，通草5，白芍10', '20', '左金丸、芍药汤');
INSERT INTO `famrecord` VALUES (58, '赵某', '男', '42', '1', '腹痛，痢下脓血', '腹部下坠，里急后重', '痢疾', '溃疡性结肠炎', '白', '滑', '脾肾两虚证', NULL, '温补脾肾，理气燥湿，收涩固脱', '白头翁5，秦皮6，椿皮炭12，赤石脂12，血余炭6，黄柏6，黄连5，干姜炭10，苍术炭10，山药25，补骨脂6，石榴皮10，党参10，阿胶12，苦参10，甘草6', '16', '白头翁汤、桃花汤、实肠丸');
INSERT INTO `famrecord` VALUES (59, '赵某', '男', '42', '2', '腹痛，痢下脓血', '腹部下坠', '痢疾', '溃疡性结肠炎', '白', '滑', '脾肾两虚证', NULL, '温补脾肾，理气燥湿，收涩固脱', '黄连5，秦皮6，赤石脂10，血余炭10，黄柏6，干姜炭10，白头翁6，椿皮炭12，阿胶12，党参10，山药25，苍术炭6，苦参10，生地炭10，熟地炭10，石榴皮10，甘草6', '17', '白头翁汤、桃花汤、实肠丸');
INSERT INTO `famrecord` VALUES (60, '赵某', '男', '42', '3', '腹痛，痢下脓血', NULL, '痢疾', '溃疡性结肠炎', '白', '滑', '脾肾两虚证', NULL, '温补脾肾，理气燥湿，收涩固脱', '杜仲6，禹余粮10，赤石脂10，续断6，吴茱萸5，黄连5，补骨脂10，椿皮炭12，五味子3，石榴皮炭10，地榆10，苍术炭10，苦参10，生地炭10，熟地炭10，党参10，甘草6', '17', '白头翁汤、桃花汤、实肠丸、左金丸、赤石脂禹余粮丸');
INSERT INTO `famrecord` VALUES (61, '于某', '女', '63', '1', '腹痛，腹泻', '胃中寒冷，腰痛，心悸，气短，胃脘胀满，食欲不振，自汗，失眠，小便短赤', '泄泻', '慢性肠炎', '白', '沉、弱', '脾肾两虚证', NULL, '补脾益肾，温阳止泻', '龙骨12，苍术炭6，牡蛎12，白术炭6，血余炭6，禹余粮10，通草5，厚朴5，浮小麦30，杜仲10，党参10，五味子5，续断10，远志10，干姜炭5，薏苡仁20，甘草3', '17', '理中丸、龙骨牡蛎汤');
INSERT INTO `famrecord` VALUES (62, '于某', '女', '63', '2', '腹痛，腹泻', '胃中寒冷，腰痛，心悸，气短，胃脘胀满，食欲不振，自汗，失眠，小便短赤', '泄泻', '慢性肠炎', '白', '沉、弱', '脾肾两虚正', NULL, '补脾益肾，温阳止泻', '苍术炭3，茯岺10，白术炭3克，茯神10，禹余粮10，血余炭6，龙骨12，续断6，干姜5，牡蛎12，杜仲6，厚朴5，五味子3，山药25，党参10，附子6，甘草3，荷梗1尺', '18', '附子理中丸、龙骨牡蛎汤');
INSERT INTO `famrecord` VALUES (63, '于某', '女', '63', '3', '腹痛，腹泻', '胃中寒冷，腰痛，心悸，气短，胃脘胀满，食欲不振，自汗，失眠，小便短赤', '泄泻', '慢性肠炎', '白', '沉、弱', '脾肾两虚证', NULL, '补脾益肾，温阳止泻', '茯苓10，车前子10，苍术炭10，茯神10，车前草10，白术炭10，肉豆蔻6，党参10，血余炭6，禹余粮6，补骨脂6，远志10，五味子3，山药25，附子6，干姜5，厚朴5，吴茱萸6，甘草3', '19', '附子理中丸');
INSERT INTO `famrecord` VALUES (64, '于某', '女', '63', '4', '腹痛，腹泻', '小便短赤', '泄泻', '慢性肠炎', '白', '沉、弱', '脾肾两虚证', NULL, '补脾益肾，温阳止泻', '车前草12，茯苓10，血余炭6，晚蚕沙6，旱莲草12，茯神10，厚朴6，白术6，玫瑰花6，肉豆蔻6，吴茱萸3，黄连3，浮小麦30，薏苡仁25，五味子3，枳壳5，通草5，补骨脂6，远志10，甘草3', '20', '理中丸、左金丸');
INSERT INTO `famrecord` VALUES (65, '朱某', '男', '69', '1', '腹痛，腹泻', '胃中寒冷，胃脘胀满', '泄泻', '慢性肠炎', '白', '沉、弱', '脾胃虚寒证', NULL, '温中散寒，健脾止泻', '党参10，干姜炭5，茯苓10，苍术炭6，白术炭6，血余炭6，禹余粮10，晚蚕沙6，黄连6，吴茱萸6，厚朴5，山药25，罂粟壳12，远志10，甘草3', '15', '理中丸、四君子汤、左金丸');
INSERT INTO `famrecord` VALUES (66, '朱某', '男', '69', '2', '腹痛，腹泻', '胃中寒冷，胃脘胀满', '泄泻', '慢性肠炎', '白', '沉、弱', '脾胃虚寒证', NULL, '温中散寒，健脾止泻', '党参10，干姜5，茯苓10，苍术6，白术6，血余炭6，禹余粮10，晚蚕沙6，黄连6，吴茱萸6，厚朴5，山药25，砂仁5，陈皮炭6，远志10，甘草3', '16', '理中丸、四君子汤、左金丸、平胃散');
INSERT INTO `famrecord` VALUES (67, '朱某', '男', '69', '3', '腹痛，腹泻', '胃中寒冷，胃脘胀满', '泄泻', '慢性肠炎', '白', '沉、弱', '脾胃虚寒证', NULL, '温中散寒，健脾和胃止泻', '山药60，罂粟壳30，鸡内金30，茯苓30，干姜15，厚朴15，陈皮炭15，吴茱萸15，党参30，黄连15，附子30，建莲肉30，血余炭30，苍术炭30，白术30，甘草15，神曲60，荷叶煎水', '17', '四君子汤、理中丸、左金丸、平胃散、曲术丸');
INSERT INTO `famrecord` VALUES (68, '朱某', '男', '69', '4', '腹痛，腹泻', '胃中寒冷，胃脘胀满', '泄泻', '慢性肠炎', '白', '沉、弱', '脾胃虚寒证', NULL, '温中散寒，健脾和胃止泻', '山药60，鸡内金30，茯苓30，厚朴15，陈皮15，吴茱萸15，党参30，黄连15，建莲肉60，血余炭30，苍术30，白术30，甘草15，神曲60，荷叶煎水', '14', '四君子汤、理中丸、左金丸、平胃散、曲术丸');
INSERT INTO `famrecord` VALUES (69, '吴某', '男', '29', '1', '腹痛，腹泻', '腰膝酸软，形寒肢冷，乏力', '泄泻', '慢性肠炎', '白', '沉、弱', '肾阳虚衰证', NULL, '温肾健脾，固涩止泻', '补骨脂6，五味子3，吴茱萸5，黄连5，肉豆蔻6，党参10，附子5，苍术炭6，茯苓12，白术炭6，赤小豆12，血余炭6，禹余粮10，干姜炭5，甘草3', '15', '理中汤、四神丸');
INSERT INTO `famrecord` VALUES (70, '吴某', '男', '29', '2', '腹痛，腹泻', '腰膝酸软，形寒肢冷，乏力', '泄泻', '慢性肠炎', '白', '沉、弱', '肾阳虚衰证', NULL, '温肾健脾，固涩止泻', '补骨脂6，五味子3，吴茱萸5，黄连5，肉豆蔻6，党参10，附子10，苍术6，茯苓12，白术6，赤小豆12，血余炭6，禹余粮10，干姜10，甘草3', '15', '理中汤、四神丸');
INSERT INTO `famrecord` VALUES (71, '吴某', '男', '29', '3', '腹痛，腹泻', '腰膝酸软，形寒肢冷，乏力', '泄泻', '慢性肠炎', '白', '沉、弱', '肾阳虚衰证', NULL, '健胃消胀，固肠止泻', '木香9，枳壳12，苍术15，茯苓15，皂荚3，藿香60，青皮9，重楼18，厚朴30，石膏24，川贝母60，紫苏24，橘红15，晚蚕沙30，半夏30，甘草9，朱砂30，沉香15，雄黄15，麝香3', '20', '七宝效灵丹');
INSERT INTO `famrecord` VALUES (72, '吴某', '男', '29', '4', '腹痛，腹泻', NULL, '泄泻', '慢性肠炎', '白', '沉、弱', '肾阳虚衰证', NULL, '温肾健脾，固涩止泻', '甘草6，白术6，干姜12，茯苓12，肉豆蔻6，五味子3，补骨脂6，吴茱萸5', '8', '四神丸、甘草干姜茯苓白术汤');
INSERT INTO `famrecord` VALUES (73, '吴某', '男', '29', '5', '腹痛，腹泻', NULL, '泄泻', '慢性肠炎', '白', '沉、弱', '肾阳虚衰证', NULL, '温肾健脾，固涩止泻', '肉豆蔻6，五味子3，补骨脂6，吴茱萸5，人参9、白术9，甘草9，干姜9，附子9', '9', '四神丸、附子理中丸');
INSERT INTO `famrecord` VALUES (74, '唐某', '男', '44', '1', '腹痛，胃脘胀满', '腹中包块，口渴而不欲饮，头晕，气短，便秘', '痞满', '慢性肠炎', '腻', '濡', '脾湿证', NULL, '健脾化湿，行气消积', '苍术炭6，白术炭6，晚蚕沙6，血余炭6，海浮石10，瓦楞子25，薏苡仁20，香附6，厚朴5，莱菔子6，茯苓6，车前草10，莱菔英6，滑石6，旱莲草10，吴茱萸5，黄连5，陈皮炭6，通草5，甘草3，鸡内金10', '21', '平胃散、左金丸');
INSERT INTO `famrecord` VALUES (75, '唐某', '男', '44', '2', '腹痛，胃脘胀满', '腹中包块，口渴而不欲饮，头晕，气短，便秘', '痞满', '慢性肠炎', '腻', '濡', '脾湿证', NULL, '健脾化湿，行气消积', '苍术炭6，白术炭6，晚蚕沙6，血余炭6，海浮石10，瓦楞子25，薏苡仁20，香附6，厚朴5，莱菔子6，茯苓6，莱菔英6，滑石6，吴茱萸5，黄连5，陈皮炭6，甘草3，党参10，桔梗5，紫苏5', '20', '平胃散、左金丸');
INSERT INTO `famrecord` VALUES (76, '唐某', '男', '44', '3', '胃脘胀满', '腹中包块，口渴而不欲饮，便秘', '痞满', '慢性肠炎', '腻', '濡', '脾湿证', NULL, '健脾化湿，行气消积', '苍术炭6，白术炭6，血余炭6，禹余粮10，海浮石10，瓦楞子25，党参10，茯苓12，厚朴5，吴茱萸5，黄连5，诃子6，藿香5，桔梗5，甘草3', '15', '除湿汤');
INSERT INTO `famrecord` VALUES (77, '刘某', '男', '41', '1', '腹泻', '腹痛', '泄泻', '慢性肠炎', '白', '濡', '脾胃虚寒证', NULL, '温中健脾，化湿止泻', '附子10，干姜5，禹余粮10，党參10，甘草6，厚朴5，茯苓12，苍术10，薏苡仁20，山药30', '10', '参苓白术散、附子理中丸');
INSERT INTO `famrecord` VALUES (78, '刘某', '男', '32', '1', '腹痛，痢脓血', '里急后重，食欲不振', '痢疾', '慢性肠炎', '白', '沉、弱', '脾肾两虚证', NULL, '温补脾肾，理气燥湿，收涩固脱', '青皮炭5，赤石脂10，禹余粮10，陈皮炭5，血余炭6，晚蚕沙10，茯苓6，苦参10，茯神6，吴茱萸5，黄连5，党参6，苍术炭6，椿皮12，肉豆蔻6，白术炭6，厚朴5，干姜炭5，五味子3，补骨脂6，甘草3', '21', '理中汤、桃花汤、赤石脂禹粮丸、四神丸、平胃散、左金丸');
INSERT INTO `famrecord` VALUES (79, '桂某', '男', '41', '1', '腹痛，脱肛，痢下脓血', '腹胀，食欲不振，便秘', '痢疾', '直肠脱垂', '黄、腻', '数', '湿热痢', NULL, '清热燥湿，调气和血', '青皮炭5，苍术炭6，血余炭6，禹余粮10，陈皮炭5，白术炭6，椿皮炭10，槐米10，吴茱萸5，黄连5，葛根炭10，地榆10，薏苡仁20，黄芩炭10，厚朴5，甘草3，苦参10', '17', '平胃散、左金丸');
INSERT INTO `famrecord` VALUES (80, '桂某', '男', '41', '2', '脱肛', NULL, '痢疾', '直肠脱垂', '白', '弱', '脾气虚弱证', NULL, '补中益气，健脾升阳', '柴胡5，升麻3，白芍10，荆芥3，血余炭10，禹余粮10，黄芪12，党参10，白术6，槐米10，陈皮3，地榆10，吴茱萸2，黄连3，甘草3，椿皮炭10，当归5，薏苡仁20', '18', '补中益气汤');
INSERT INTO `famrecord` VALUES (81, '阴某', '男', '23', '1', '腹痛，脱肛，痢下脓血', '食欲不振，乏力，腹部下坠', '痢疾', '慢性结肠炎', '白', '弱', '脾气虚弱证', NULL, '补中益气，健脾升阳', '黄芪12，党参10，陈皮炭5，当归5，升麻3，薏苡仁20，柴胡5，苍术炭6，白芍10，晚蚕沙6，血余炭10，白术炭6，茯苓10，甘草3', '14', '补中益气汤');
INSERT INTO `famrecord` VALUES (82, '阴某', '男', '23', '2', '腹痛，痢下脓血', NULL, '痢疾', '慢性结肠炎', '白', '弱', '脾气虚弱证', NULL, '补中益气，健脾升阳', '黄芪12，党参10，茯苓10，苍术炭6，柴胡5，白术炭6，血余炭10，赤石脂10，白芍10，厚朴5，黄连5，薏苡仁12，甘草3，陈皮炭6', '14', '五味异功散');
INSERT INTO `famrecord` VALUES (83, '侯某', '男 ', '52', '1', '腹痛，腹泻，痢下脓血', '面色苍白，消瘦，气短，少神，乏力，咳嗽，咳痰，小便少', '肠痨', '肠结核', '无苔', '弱', '脾胃气虚证', NULL, '健脾润肺止咳', '茯苓10，车前草12，茯神10，血余炭10，禹余粮10，旱莲草12，杏仁6，白前5，紫苑5，薏苡仁15，百部5，橘红5，山药30，白术10，苍术炭10，北沙参12，诃子肉10，甘草3', '18', '止嗽散、参苓白术散');
INSERT INTO `famrecord` VALUES (84, '侯某', '男', '52', '2', '腹痛，腹泻，痢下脓血', '面色苍白，消瘦，气短，少神，乏力，咳嗽，咳痰，小便少', '肠痨', '肠结核', '无苔', '沉、弱', '脾胃气虚证', '气虚', '健脾益气', '茯苓10，车前草12，茯神10，血余炭10，禹余粮10，旱莲草12，杏仁6，紫苑5，薏苡仁15，橘红5，山药30，白术10，苍术炭10，诃子肉10，甘草3，赤石脂10，白石脂10，吴茱萸5，黄连5，地榆10，远志10', '21', '左金丸');
INSERT INTO `famrecord` VALUES (85, '侯某', '男', '52', '3', '腹痛，腹泻，痢下脓血', '面色苍白，消瘦，气短，少神，乏力，咳嗽，咳痰，小便少', '肠痨', '肠结核', '无苔', '沉、弱', '脾胃气虚证', '气虚', '健脾益气，散寒渗湿', '天生磺3，附子3，人参3，白术3，干姜3，甘草3，建莲肉9，苍术6，薏苡仁12，砂仁9，桔梗9，白扁豆9，茯苓20，山药9 ', '14', '附子理中丸、参苓白术散');
INSERT INTO `famrecord` VALUES (86, '侯某', '男', '52', '4', '腹痛，腹泻', '口干渴', '肠痨', '肠结核', '无苔', '沉、弱', '脾胃气虚证', '气虚', '健脾益气，固肠止泻', '天生磺2，人参3，白术3，茯苓6，甘草2，陈皮2.5，半夏3，砂仁2.5，木香2，生姜6，肉豆蔻6，五味子6，补骨脂12，吴茱萸3 ', '14', '香砂六君子汤、四神丸');
INSERT INTO `famrecord` VALUES (87, '侯某', '男', '52', '5', '腹痛，腹泻', NULL, '肠痨', '肠结核', '无苔', '沉、弱', '脾胃气虚证', '气虚', '健脾益气', '白芨6，天生磺5，橘络5，橘红5，石斛6，紫苑5，苍术6，诃子肉5，白术6，人参5，禹余粮6，茯苓6，砂仁3，青皮3，甘草6，车前子5，茯神6，远志5，五味子5，厚朴5，山药30 ', '21', '四君子汤');
INSERT INTO `famrecord` VALUES (88, '侯某', '男', '52', '6', '腹泻', '食欲不振，乏力，气短，心悸', '肠痨', '肠结核', '无苔', '沉、弱', '脾胃气虚证', '气虚', '健脾益气，补血养阴', '人参10，西洋参10，北沙参10，白术20，莲肉20，天生磺8，白芨10，远志10，茯苓20，紫河车10，龙涎香2，诃子肉10，山药20，阿胶20，五味子10，陈皮5，砂仁5，木香4，半夏10，甘草6', '20', '四君子汤');
INSERT INTO `famrecord` VALUES (89, '侯某', '男', '52', '7', '腹泻', '失眠', '肠痨', '肠结核', '白', '弱', '脾胃气虚证', '气虚', '健脾益气，养心安神', '人参10，西洋参10，北沙参10，白术20，莲肉20，天生磺8，白芨10，远志10，茯苓20，紫河车10，龙涎香2，诃子肉10，山药20，阿胶20，五味子10，陈皮5，砂仁5，木香4，半夏10，甘草6，琥珀5，酸枣仁10', '22', '四君子汤');
INSERT INTO `famrecord` VALUES (90, '侯某', '男', '52', '8', '腹泻', NULL, '肠痨', '肠结核', '白', '弱', '脾胃气虚证', '气虚', '健脾益气', '山药30，真糯米30，白术30，薏苡仁30，茯苓30 ', '5', '四君子汤');
INSERT INTO `famrecord` VALUES (91, '赵某', '女', '22', '1', '腹痛，腹泻，大便不调', '胃脘胀满，呕吐，呃逆，食欲不振，发热，小便短赤', '肠痨', '肠结核', '白', '沉、弱', '脾胃气虚证', '气虚', '升清降浊，调和表里', '柴胡5，苍术炭6，茯苓10，白芍6，赤芍6，白术炭6，赤小豆20，吴茱萸5，扁豆花10，黄连5，血余炭5，禹余粮10，扁豆衣10，党参6，车前子10，山药25，建莲肉15，厚朴5，罂粟壳12，甘草3，半夏6', '21', '参苓白术散、左金丸');
INSERT INTO `famrecord` VALUES (92, '赵某', '女', '22', '2', '腹痛，腹泻，大便不调', '胃脘胀满，呕吐，呃逆，食欲不振，发热，小便短赤', '肠痨', '肠结核', '白', '沉、弱', '脾胃气虚证', '气虚', '升清降浊，调和表里', '柴胡5，苍术6，茯苓10，白芍6，赤芍6，白术6，赤小豆20，吴茱萸5，黄连5，血余炭5，禹余粮10，白扁豆30，党参6，山药25，建莲肉15，厚朴5，罂粟壳12，甘草3，半夏6，竹茹6，陈皮炭6', '21', '参苓白术散、左金丸、温胆汤');
INSERT INTO `famrecord` VALUES (93, '赵某', '女', '22', '3', '腹痛，腹泻', '胃脘胀满，呕吐，呃逆，食欲不振，小便短赤', '肠痨', '肠结核', '白', '沉、弱', '脾胃气虚证', '气虚', '健脾益气', '山药25，白扁豆30，五味子3，苍术炭6，黄连5，吴茱萸5，白术炭6，血余炭6，禹余粮10，党参10，建莲肉12，罂粟壳12，茯苓12，半夏6，厚朴3，干姜炭3，白芍6，甘草3  ', '18', '参苓白术散、左金丸、理中丸');
INSERT INTO `famrecord` VALUES (94, '赵某', '女', '22', '4', '腹痛，腹泻', '胃脘胀满', '肠痨', '肠结核', '白', '沉、弱', '脾胃气虚证', '气虚', '健脾益气', '党参10，干姜炭3，茯苓10，白扁豆30，山药25，五味子3，苍术炭6，霞天曲6，白术炭6，黄连5，吴茱萸5，半夏曲6，薏苡仁15，建莲肉15，砂仁3，甘草3', '16', '参苓白术散、左金丸、理中丸');
INSERT INTO `famrecord` VALUES (95, '丛某', '女', '25', '1', '腹泻，便血', NULL, '便血', '直肠破溃', '白', '弱', '脾胃气虚证', '气虚', '健脾止血，固肠', '苍术炭6，赤石脂10，禹余粮10，血余炭6，红曲6，白术炭6，木耳炭10，黑升麻3，柿饼炭30，荆芥炭10，吴茱萸5，黄连5，阿胶12，地榆10，槐米10，甘草6  ', '16', '左金丸、赤石脂禹余粮丸');
INSERT INTO `famrecord` VALUES (96, '丛某', '女', '25', '2', '腹泻，便血', NULL, '便血', '直肠破溃', '白', '弱', '脾胃气虚证', '气虚', '健脾止血，固肠', '苍术炭6，赤石脂10，禹余粮10，血余炭6，红曲6，白术炭6，木耳炭10，黑升麻3，柿饼炭30，荆芥炭10，吴茱萸5，黄连5，阿胶12，地榆10，槐米10，甘草6，山药25，罂粟壳12', '18', '左金丸、赤石脂禹余粮丸');
INSERT INTO `famrecord` VALUES (97, '从某', '女', '25', '3', '腹泻，便血', '胃脘胀满', '便血', '直肠破溃', '白', '弱', '脾胃气虚证', '气虚', '健脾止血，固肠', '党参10，诃子肉10，白术炭6，茯苓10，苍术炭6，甘草6，黄连6，吴茱萸6，赤石脂10，禹余粮10，血余炭10，山药25，厚朴5', '13', '四君子汤、左金丸、赤石脂禹余粮丸');
INSERT INTO `famrecord` VALUES (98, '安某', '男', '74', '1', '便血', '便秘，气短，腹胀', '便血', '痔', '白', '沉、弱', '气阴亏虚证', NULL, '健脾益气养阴润燥', '党参6，白术6，阿胶10，生地炭10，地榆10，熟地炭10，槐米10，晚蚕沙10，皂角子10，柿饼炭30，木耳炭10，火麻仁15，仙鹤草25，厚朴5', '14', '四君子汤、槐角地榆丸');
INSERT INTO `famrecord` VALUES (99, '安某', '男', '74', '2', '便血', '便秘，气短，腹胀', '便血', '痔', '白', '沉、弱', '气阴亏虚证', NULL, '健脾益气养阴润燥', '荆芥5，黑升麻炭5，血余炭10，晚蚕沙10，赤石脂10，禹余粮10，生地炭20，苍术炭6，槐米10，熟地炭20，白术炭6，地榆10，党参10，柿饼炭30，木耳炭10，阿胶10，仙鹤草25，甘草6，椿皮炭12 ', '19', '赤石脂禹余粮丸、实肠丸、苍术地榆汤 ');
INSERT INTO `famrecord` VALUES (100, '安某', '男', '74', '3', '便血', NULL, '便血', '痔', '白', '沉、弱', '气阴亏虚证', NULL, '健脾益气养阴润燥', '党参10，黄芪20，山药25，生地炭20，黑升麻3，熟地炭20，荆芥炭3，赤石脂10，禹余粮10，椿皮炭12，阿胶10，苍术炭10，地榆10，仙鹤草25，木耳炭10，柿饼炭30，石榴皮15，灶心土90', '18', '黄土汤、赤石脂禹余粮丸');
INSERT INTO `famrecord` VALUES (101, '左某', '女', '44', '1', '便秘，大便数日一行', '胃痛，胸闷，食欲不振，腹胀，口干而不欲饮，心悸，气短，呕吐，呃逆，反酸，小便短少', '便秘', '功能性便秘', '红', '涩', '气滞证', NULL, '行气导滞，通利二便', '半夏曲6，代赭石12，旋覆花6，神曲6，晚蚕沙10，皂角子10，茯苓6，瓜蒌24，薤白6，佛手6，玫瑰花6，厚朴5，枳壳6，远志10，冬瓜子12，青皮炭5，莱菔子6，冬葵子12，陈皮炭5，莱菔英6，郁金10，甘草3  ', '22', '旋覆代赭汤、瓜蒌薤白半夏汤汤');
INSERT INTO `famrecord` VALUES (102, '左某', '女', '44', '2', '便秘，大便数日一行', '胸闷，食欲不振，口干而不欲饮，腹胀，心悸，气短，呕吐，呃逆，反酸，小便短少', '便秘', '功能性便秘', '红', '涩', '气滞证', NULL, '行气导滞，通利二便', '半夏曲6，茯苓6，代赭石12，旋覆花6，神曲6，茯神6，冬瓜子12，莱菔子6，吴茱萸0.6，黄连3，冬葵子12，莱菔英6，厚朴5，枳壳5，远志10，砂仁3，白豆蔻3，郁金10，桔梗5，柿蒂6，鸡内金10，甘草3', '22', '旋覆代赭汤');
INSERT INTO `famrecord` VALUES (103, '刘某', '女', '55', '1', '便秘，大便数日一行', '背痛，腹中冷，食欲不振，胸闷，胃脘胀满', '便秘', '功能性便秘', '少苔', '沉、弱', '阴虚秘', '阴亏', '滋阴润燥', '薤白10，郁李仁10，瓜篓20，晚蚕沙10，皂角子6，火麻仁20，桃仁6，砂仁3，玫瑰花6，杏仁6，白豆蔻3，厚朴6，北沙参12，枳壳5，白术5，丹参12，谷芽10，麦芽10  ', '18', '瓜蒌薤白半夏汤、枳术丸、麻仁润肠丸');
INSERT INTO `famrecord` VALUES (104, '刘某', '女', '55', '2', '便秘，大便数日一行', '背痛，腹中冷，胸闷，胃脘胀满', '便秘', '功能性便秘', '少苔', '沉、弱', '阴虚秘', '阴亏', '滋阴润燥', '薤白10，莱菔子6，瓜篓20，莱菔英6，代赭石12，旋覆花6，枳壳5，砂仁3，白豆蔻3，刀豆子12，白术5，桃仁6，郁李仁6，桔梗5，火麻仁15，厚朴5，鸡内金10，北沙参12，陈皮炭6', '19', '旋覆代赭汤、瓜蒌薤白半夏汤、枳术丸、麻仁润肠丸');
INSERT INTO `famrecord` VALUES (105, '刘某', '女', '55', '3', '便秘，大便数日一行', NULL, '便秘', '功能性便秘', '少苔', '沉、弱', '阴虚秘', '阴亏', '滋阴润燥', '薤白10，莱菔子6，瓜篓20，莱菔英6，皂角子10，晚蚕沙10，枳壳5，厚朴6，柏子仁10，白术5，玫瑰花6，火麻仁15，丹参12，鸡内金10，当归10', '15', '瓜蒌薤白半夏汤、枳术丸、麻仁润肠丸');
INSERT INTO `famrecord` VALUES (106, '王某', '女', '60', '1', '便秘，大便数日一行', '腹胀，腹部下坠，食欲不振', '便秘', '功能性便秘', '白', '沉、弱', '阳虚秘', NULL, '补肾温阳', '肉苁蓉30，莱菔子6，胡桃肉30，皂角子10，晚蚕沙10，莱菔英6，火麻仁15，当归12，厚朴5，桃仁6，杏仁6，柴胡5，桔梗5，紫苏5，白芍10，枳壳5', '16', '麻子仁丸');
INSERT INTO `famrecord` VALUES (107, '王某', '女', '60', '2', '便秘，大便数日一行', '腹胀，腹部下坠，食欲不振', '便秘', '功能性便秘', '白', '沉、弱', '脾气虚弱证', NULL, '健脾益气，升清降浊', '柴胡5，桔梗5，青皮炭5，白芍10，白术5，陈皮炭5，莱菔子6，槟榔6，厚朴5，莱菔英6，大腹皮6，枳壳5，茯苓12，佩兰6，鸡内金10，杏仁10', '16', '保和丸、枳实消痞丸');
INSERT INTO `famrecord` VALUES (108, '曾某', ' 女', '55', '1', '便秘，大便数日一行', '食欲不振，胃脘胀满，腹痛', '便秘', '功能性便秘', '白', '沉、弱', '阳虚秘', NULL, '补肾温阳，润肠通便', '肉苁蓉30，当归9，火麻仁12，晚蚕沙9，皂角子9，薤白9，杏仁6，佩兰9，玫瑰花4.5，代代花4.5，郁金4.5，谷芽9，麦芽9，鸡内金9，瓜蒌18', '15', '瓜蒌薤白汤');
INSERT INTO `famrecord` VALUES (109, '侯某', '男', '34', '1', '腹痛', '腹胀，发热', '腹痛', '慢性腹膜炎', '黄、腻', '弦', '湿热证', NULL, '清热利湿', '赤芍15，白芍15，柴胡9，冬瓜子30，大腹皮9，丹皮6，丹参6，茯苓9，车前草9，旱莲草9，木香3，黄芩6，生地黄1.5，茅根1.5，半夏9，泽泻9，甘草3，乌药4.5，香附6，陈皮炭9', '20', '小柴胡汤');
INSERT INTO `famrecord` VALUES (110, '侯某', '男', '34', '2', '腹痛', '腹胀，发热', '腹痛', '慢性腹膜炎', '黄、腻', '弦', '湿热证', NULL, '清热利湿', '赤芍15，白芍15，柴胡9，血余炭9，益元散15，车前草9，旱莲草9，通草4.5，茯苓9，茅根15，生地黄15，丹参6，牡丹皮6，大腹皮9，冬瓜子60，黄芩6，半夏9，乌药4.5，香附6，陈皮9，甘草4.5', '21', '小柴胡汤');
INSERT INTO `famrecord` VALUES (111, '侯某', '男', '34', '3', '腹痛', NULL, '腹痛', '慢性腹膜炎', '黄、腻', '弦', '湿热证', NULL, '清热利湿', '赤芍15，白芍15，柴胡9，生地黄9，白茅根12，黄芩6，半夏9，冬瓜子15，冬葵子15，大腹皮9，血余炭9，车前子9，猪苓9，茯苓9，陈皮炭9，牡丹皮6，丹参6，甘草3，西洋参4.5', '19', '小柴胡汤');
INSERT INTO `famrecord` VALUES (112, '庞某', '男', '57', '1', '皮肤黄染', '发热，头痛，恶心，呕吐，胸闷，食欲不振，便秘', '黄疸', '肝硬化', '黄、腻', '数', '湿热证', NULL, '清热利湿', '豆黄卷30，茵陈9，栀子4.5，大黄炭4.5，吴茱萸0.6，黄连2.4，竹茹6，半夏9，黄芩6，芦根一尺，白茅根15，通草4.5，生地黄9，赤芍6，僵蚕4.5，蔓荆子4.5，陈皮炭9', '17', '茵陈蒿汤');
INSERT INTO `famrecord` VALUES (113, '庞某', '男', '57', '2', '皮肤黄染', '发热，胸闷，食欲不振', '黄疸', '肝硬化', '黄、腻', '数', '湿热证', NULL, '清热利湿', '豆黄卷30，赤芍6，白芍6，柴胡4.5，茵陈9，栀子4.5，大黄炭4.5，白茅根12，生地黄9，半夏9，黄芩6，桔梗4.5，枳壳4.5，杏仁6，薤白6，厚朴4.5，代代花4.5，陈皮炭9，甘草3，益元散9，车前子9', '21', '茵陈蒿汤、小柴胡汤');
INSERT INTO `famrecord` VALUES (114, '庞某', '男', '57', '3', '皮肤黄染', NULL, '黄疸', '肝硬化', '黄、腻', '数', '湿热证', NULL, '清热利湿', '豆黄卷18，白芍9，柴胡4.5，茵陈9，栀子4.5，神曲6，半夏曲6，黄芩6，佩兰9，厚朴4.5，代代花4.5，谷芽9，麦芽9，陈皮炭9，桔梗4.5，枳壳4.5，杏仁6，薤白6，甘草1.5', '19', '茵陈蒿汤、小柴胡汤');
INSERT INTO `famrecord` VALUES (115, '苏某', '男', '53', '1', '腹痛', '胃脘胀满，便秘', '腹痛', '慢性肠炎', '黄', '数', '里实热证', NULL, '清热解毒，行气止痛', '大黄炭4.5，芒硝6，晚蚕沙9，皂角子9，杏仁6，桃仁6，赤芍15，白芍15，柴胡6，吴茱萸1.5，黄连3，延胡索6，丹参12，陈皮炭9，薤白6，乌药4.5，甘草6，木香3，瓜蒌18', '19', '桃核乘气汤、芍药甘草汤');
INSERT INTO `famrecord` VALUES (116, '苏某', '男', '53', '2', '腹痛', '胃脘胀满', '腹痛', '慢性肠炎', '黄', '数', '里实热证', NULL, '清热解毒，行气止痛', '赤芍15，白芍15，甘草6，杏仁6，薏苡仁12，败酱草9，黄连4.5，大黄炭4.5，桃仁6，瓜蒌15，芒硝6，晚蚕沙9，皂角子9，薤白6，莱菔子4.5，莱菔英9，陈皮炭9，冬瓜子15，丹参6，牡丹皮6，黄芩6', '21', '桃核乘气汤、芍药甘草汤、大黄牡丹汤');
COMMIT;

-- ----------------------------
-- Table structure for merecord
-- ----------------------------
DROP TABLE IF EXISTS `merecord`;
CREATE TABLE `merecord` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `sex` varchar(25) DEFAULT NULL,
  `age` varchar(25) DEFAULT NULL,
  `frequ` varchar(25) DEFAULT NULL,
  `chcom` text,
  `symptom` text,
  `zdiagnosis` text,
  `xdiagnosis` text,
  `tonfur` varchar(50) DEFAULT NULL,
  `pulse` varchar(50) DEFAULT NULL,
  `dialetype` text,
  `cercate` text,
  `rule` text,
  `drugs` longtext,
  `count` varchar(25) DEFAULT NULL,
  `prescription` text,
  `time` varchar(25) DEFAULT NULL,
  `price` varchar(25) DEFAULT NULL,
  `dockername` varchar(50) DEFAULT NULL,
  `userid` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of merecord
-- ----------------------------
BEGIN;
INSERT INTO `merecord` VALUES (1, '安某', '男', '74', '3', '便血', NULL, '便血', '痔', '白', '沉、弱', '气阴亏虚证', NULL, '健脾益气养阴润燥', '党参10，黄芪20，山药25，生地炭20，黑升麻3，熟地炭20，荆芥炭3，赤石脂10，禹余粮10，椿皮炭12，阿胶10，苍术炭10，地榆10，仙鹤草25，木耳炭10，柿饼炭30，石榴皮15，灶心土90', '18', '黄土汤、赤石脂禹余粮丸', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (2, '左某', '女', '44', '1', '便秘，大便数日一行', '胃痛，胸闷，食欲不振，腹胀，口干而不欲饮，心悸，气短，呕吐，呃逆，反酸，小便短少', '便秘', '功能性便秘', '红', '涩', '气滞证', NULL, '行气导滞，通利二便', '半夏曲6，代赭石12，旋覆花6，神曲6，晚蚕沙10，皂角子10，茯苓6，瓜蒌24，薤白6，佛手6，玫瑰花6，厚朴5，枳壳6，远志10，冬瓜子12，青皮炭5，莱菔子6，冬葵子12，陈皮炭5，莱菔英6，郁金10，甘草3  ', '22', '旋覆代赭汤、瓜蒌薤白半夏汤汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (3, '左某', '女', '44', '2', '便秘，大便数日一行', '胸闷，食欲不振，口干而不欲饮，腹胀，心悸，气短，呕吐，呃逆，反酸，小便短少', '便秘', '功能性便秘', '红', '涩', '气滞证', NULL, '行气导滞，通利二便', '半夏曲6，茯苓6，代赭石12，旋覆花6，神曲6，茯神6，冬瓜子12，莱菔子6，吴茱萸0.6，黄连3，冬葵子12，莱菔英6，厚朴5，枳壳5，远志10，砂仁3，白豆蔻3，郁金10，桔梗5，柿蒂6，鸡内金10，甘草3', '22', '旋覆代赭汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (4, '刘某', '女', '55', '1', '便秘，大便数日一行', '背痛，腹中冷，食欲不振，胸闷，胃脘胀满', '便秘', '功能性便秘', '少苔', '沉、弱', '阴虚秘', '阴亏', '滋阴润燥', '薤白10，郁李仁10，瓜篓20，晚蚕沙10，皂角子6，火麻仁20，桃仁6，砂仁3，玫瑰花6，杏仁6，白豆蔻3，厚朴6，北沙参12，枳壳5，白术5，丹参12，谷芽10，麦芽10  ', '18', '瓜蒌薤白半夏汤、枳术丸、麻仁润肠丸', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (5, '刘某', '女', '55', '2', '便秘，大便数日一行', '背痛，腹中冷，胸闷，胃脘胀满', '便秘', '功能性便秘', '少苔', '沉、弱', '阴虚秘', '阴亏', '滋阴润燥', '薤白10，莱菔子6，瓜篓20，莱菔英6，代赭石12，旋覆花6，枳壳5，砂仁3，白豆蔻3，刀豆子12，白术5，桃仁6，郁李仁6，桔梗5，火麻仁15，厚朴5，鸡内金10，北沙参12，陈皮炭6', '19', '旋覆代赭汤、瓜蒌薤白半夏汤、枳术丸、麻仁润肠丸', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (6, '刘某', '女', '55', '3', '便秘，大便数日一行', NULL, '便秘', '功能性便秘', '少苔', '沉、弱', '阴虚秘', '阴亏', '滋阴润燥', '薤白10，莱菔子6，瓜篓20，莱菔英6，皂角子10，晚蚕沙10，枳壳5，厚朴6，柏子仁10，白术5，玫瑰花6，火麻仁15，丹参12，鸡内金10，当归10', '15', '瓜蒌薤白半夏汤、枳术丸、麻仁润肠丸', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (7, '王某', '女', '60', '1', '便秘，大便数日一行', '腹胀，腹部下坠，食欲不振', '便秘', '功能性便秘', '白', '沉、弱', '阳虚秘', NULL, '补肾温阳', '肉苁蓉30，莱菔子6，胡桃肉30，皂角子10，晚蚕沙10，莱菔英6，火麻仁15，当归12，厚朴5，桃仁6，杏仁6，柴胡5，桔梗5，紫苏5，白芍10，枳壳5', '16', '麻子仁丸', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (8, '王某', '女', '60', '2', '便秘，大便数日一行', '腹胀，腹部下坠，食欲不振', '便秘', '功能性便秘', '白', '沉、弱', '脾气虚弱证', NULL, '健脾益气，升清降浊', '柴胡5，桔梗5，青皮炭5，白芍10，白术5，陈皮炭5，莱菔子6，槟榔6，厚朴5，莱菔英6，大腹皮6，枳壳5，茯苓12，佩兰6，鸡内金10，杏仁10', '16', '保和丸、枳实消痞丸', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (9, '曾某', ' 女', '55', '1', '便秘，大便数日一行', '食欲不振，胃脘胀满，腹痛', '便秘', '功能性便秘', '白', '沉、弱', '阳虚秘', NULL, '补肾温阳，润肠通便', '肉苁蓉30，当归9，火麻仁12，晚蚕沙9，皂角子9，薤白9，杏仁6，佩兰9，玫瑰花4.5，代代花4.5，郁金4.5，谷芽9，麦芽9，鸡内金9，瓜蒌18', '15', '瓜蒌薤白汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (10, '侯某', '男', '34', '1', '腹痛', '腹胀，发热', '腹痛', '慢性腹膜炎', '黄、腻', '弦', '湿热证', NULL, '清热利湿', '赤芍15，白芍15，柴胡9，冬瓜子30，大腹皮9，丹皮6，丹参6，茯苓9，车前草9，旱莲草9，木香3，黄芩6，生地黄1.5，茅根1.5，半夏9，泽泻9，甘草3，乌药4.5，香附6，陈皮炭9', '20', '小柴胡汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (11, '侯某', '男', '34', '2', '腹痛', '腹胀，发热', '腹痛', '慢性腹膜炎', '黄、腻', '弦', '湿热证', NULL, '清热利湿', '赤芍15，白芍15，柴胡9，血余炭9，益元散15，车前草9，旱莲草9，通草4.5，茯苓9，茅根15，生地黄15，丹参6，牡丹皮6，大腹皮9，冬瓜子60，黄芩6，半夏9，乌药4.5，香附6，陈皮9，甘草4.5', '21', '小柴胡汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (12, '侯某', '男', '34', '3', '腹痛', NULL, '腹痛', '慢性腹膜炎', '黄、腻', '弦', '湿热证', NULL, '清热利湿', '赤芍15，白芍15，柴胡9，生地黄9，白茅根12，黄芩6，半夏9，冬瓜子15，冬葵子15，大腹皮9，血余炭9，车前子9，猪苓9，茯苓9，陈皮炭9，牡丹皮6，丹参6，甘草3，西洋参4.5', '19', '小柴胡汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (13, '庞某', '男', '57', '1', '皮肤黄染', '发热，头痛，恶心，呕吐，胸闷，食欲不振，便秘', '黄疸', '肝硬化', '黄、腻', '数', '湿热证', NULL, '清热利湿', '豆黄卷30，茵陈9，栀子4.5，大黄炭4.5，吴茱萸0.6，黄连2.4，竹茹6，半夏9，黄芩6，芦根一尺，白茅根15，通草4.5，生地黄9，赤芍6，僵蚕4.5，蔓荆子4.5，陈皮炭9', '17', '茵陈蒿汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (14, '庞某', '男', '57', '2', '皮肤黄染', '发热，胸闷，食欲不振', '黄疸', '肝硬化', '黄、腻', '数', '湿热证', NULL, '清热利湿', '豆黄卷30，赤芍6，白芍6，柴胡4.5，茵陈9，栀子4.5，大黄炭4.5，白茅根12，生地黄9，半夏9，黄芩6，桔梗4.5，枳壳4.5，杏仁6，薤白6，厚朴4.5，代代花4.5，陈皮炭9，甘草3，益元散9，车前子9', '21', '茵陈蒿汤、小柴胡汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (15, '庞某', '男', '57', '3', '皮肤黄染', NULL, '黄疸', '肝硬化', '黄、腻', '数', '湿热证', NULL, '清热利湿', '豆黄卷18，白芍9，柴胡4.5，茵陈9，栀子4.5，神曲6，半夏曲6，黄芩6，佩兰9，厚朴4.5，代代花4.5，谷芽9，麦芽9，陈皮炭9，桔梗4.5，枳壳4.5，杏仁6，薤白6，甘草1.5', '19', '茵陈蒿汤、小柴胡汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (16, '苏某', '男', '53', '1', '腹痛', '胃脘胀满，便秘', '腹痛', '慢性肠炎', '黄', '数', '里实热证', NULL, '清热解毒，行气止痛', '大黄炭4.5，芒硝6，晚蚕沙9，皂角子9，杏仁6，桃仁6，赤芍15，白芍15，柴胡6，吴茱萸1.5，黄连3，延胡索6，丹参12，陈皮炭9，薤白6，乌药4.5，甘草6，木香3，瓜蒌18', '19', '桃核乘气汤、芍药甘草汤', '2020-04-20', NULL, NULL, 1);
INSERT INTO `merecord` VALUES (17, '苏', '男', '5', '1', '腹痛', '胃脘胀满', '腹痛', '慢性肠炎', '黄', '数', '里实热证', '', '清热解毒，行气止痛', '赤芍15，白芍15，甘草6，杏仁6，薏苡仁12，败酱草9，黄连4.5，大黄炭4.5，桃仁6，瓜蒌15，芒硝6，晚蚕沙9，皂角子9，薤白6，莱菔子4.5，莱菔英9，陈皮炭9，冬瓜子15，丹参6，牡丹皮6，黄芩6', '21', '桃核乘气汤、芍药甘草汤、大黄牡丹汤', '2020-04-20', '0', '1', 1);
COMMIT;

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) DEFAULT NULL,
  `account` varchar(25) DEFAULT NULL,
  `password` varchar(25) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES (1, 'admin', 'admin1', '123456');
INSERT INTO `user` VALUES (2, 'admin2', 'admin2', '123456');
INSERT INTO `user` VALUES (3, 'admin3', 'admin3', '123456');
INSERT INTO `user` VALUES (4, 'admin4', 'admin4', '123456');
INSERT INTO `user` VALUES (5, 'admin5', 'admin5', '123456');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
